rails_for_ember/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    # Post is the model
    @posts = Post.all

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    #  Query data
    @post = Post.find(params[:id])